// const words = `
// | 汉字写法      | 假名写法      | 含义         | 罗马音     |
// | :-------- | :-------- | :----------- | :------ |
// | 青い・蒼い     | あおい２      |              | aoi     |
// | 赤い        | あかい0      |              | akai    |
// | かっこいい４    | かっこいい４    | 帅的,一流的       | kakkoii |
// | お菓子       | おかし2      | 点心，糕点，糖果     |         |
// | 自己        | じこ１       |              |         |
// | 事故        | じこ１       |              |         |
// | 家         | いえ２       |              |         |
// | いいえ３      | いいえ３      | 不,no         |         |
// | いい1       | いい1       | 好            |         |
// | 言う        | いう        |              |         |
// | 人生        | じんせい1     |              |         |
// | 恋         | こい1       |              |         |
// | 結果        | けっか０      |              |         |
// | 最高        | さいこう0     |              |         |
// | 最後        | さいご1      |              |         |
// | 午後        | ごご1       |              |         |
// | ～歳        | さい1       |              |         |
// | 顔         | かお0       |              |         |
// | 笑顔        | えがお０      | 笑脸           |         |
// | 怪我        | けが0       | 受伤，过错        |         |
// | 多い        | おおい１      |              |         |
// | ここ・そこ・あそこ |           | 这里，那里，（更远）那里 |         |
// | 凄い        | すごい２      |              |         |
// | 家事        | かじ1       |              |         |
// | 火事        | かじ1       |              |         |
// | 外国人       | がいごくじん    |              |         |
// | 禁止        | きんし１      |              |         |
// | 英語        | えいご０      |              |         |
// | すこし       | すこし       | 稍微，有点        |         |
// | 声         | こえ１       | 生物的声音        |         |
// | 音         | おん        | 非生物（乐器等）的声音  |         |
// | 聞く・聴く     | きく０       |              |         |
// | 音楽＋家      | おんがく１+か   |              |         |
// | 駅         | えき        | 车站           |         |
// | 買う        | かう0       |              |         |
// | 秋         | あき1       |              |         |
// | 西瓜        | すいか・スイカ 0 |              |         |
// | すぐ        |           |              |         |
// | 水泳        | すいえい      | 有用           |         |
//
//
// `

export const getWordList = async function (){
    const words = await fetch('./word-list.txt').then(response=>response.text())
    const word_arr = words.split(/\r?\n/).filter(Boolean).slice(2);//不要前面2个
    const reg = /\|\s*(.+?)\s+\|\s*(.+?)\s+\|\s*(.+?)\s+\|\s*(.+?)\s+/
    const final_words = [];
    for(let x of word_arr){
        const result = reg.exec(x);
        if(result){
            const [,han,kana,meaning,roman] = result;
            final_words.push([han,kana,meaning,roman])
        }

    }
    return final_words;

}
